Tekla Open API Reference for Tekla Structures 2025
IHasChildren.GetObjects Method (Type[])
 Gets the children of the current object that are of certain types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
DrawingObjectEnumerator GetObjects(
	Type[] TypeFilter
)
Function GetObjects (
	TypeFilter As Type()
) As DrawingObjectEnumerator
Parameters
TypeFilter
Type: System.Type[]
The types of the objects to get.
Return Value
Type: DrawingObjectEnumerator
The children of the current object that are of certain types.
See Also
Reference
IHasChildren Interface
GetObjects Overload
Tekla.Structures.Drawing Namespace